# GetHashCode Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ForgeTypeId..::..GetHashCode Method
ForgeTypeId Class See Also
---
Returns the hash code for this ForgeTypeId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public override int GetHashCode()
```

Visual Basic
---
```text
Public Overrides Function GetHashCode As Integer
```

Visual C++
---
```text
public:
virtual int GetHashCode() override
```

# ### Return Value
A 32-bit signed integer hash code.
# See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace